saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.LPC54606_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.0.1" condition="device.LPC54606_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_dma">
      <description>USART Driver</description>
      <files>
        <file category="header" name="drivers/fsl_usart_dma.h"/>
        <file category="sourceC" name="drivers/fsl_usart_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.0.3" condition="device.LPC54606_AND_driver.flexcomm">
      <description>USART Driver</description>
      <files>
        <file category="header" name="drivers/fsl_usart.h"/>
        <file category="sourceC" name="drivers/fsl_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.LPC54606_AND_device.LPC54606_CMSIS_AND_driver.clock_AND_driver.reset">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54606" Cversion="1.0.0" condition="device.LPC54606_AND_component.serial_manager_uart_AND_component.usart_adapter_AND_device.LPC54606_startup_AND_driver.clock_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.reset_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="LPC54606_startup" Cversion="1.0.0" condition="device.LPC54606_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_LPC54606.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54606.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54606J256_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54606J256_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54606J512_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54606J512_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54606J256_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54606J256_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54606J512_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54606J512_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="LPC54606.h"/>
        <file category="header" attr="config" name="LPC54606_features.h"/>
        <file category="sourceC" attr="config" name="system_LPC54606.c"/>
        <file category="header" attr="config" name="system_LPC54606.h"/>
      </files>
    </component>
  </components>
</package>
